{
  "backend/main.mo": "Defines core data models for posts, messages, job posts, applications, coach profiles, and includes comparison helpers, storage maps, and authorization/storage mixins.",
  "feature_evidence.json": "Feature evidence report listing UI attachment viewer updates with associated files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend components, hooks, pages, and styling files across the application.",
  "frontend/index.css": "Tailwind base/theme config defining light and dark mode OKLCH color variables and global styles.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app component handling Internet Identity auth, actor initialization, profile loading with timeout, and routing between dashboard and landing page.",
  "frontend/src/components/AdminBadge.tsx": "Simple UI badge that displays an ADMIN label with a shield icon.",
  "frontend/src/components/AdminBanner.tsx": "Admin-only alert banner that polls for new notifications and allows dismissal via a backend mutation.",
  "frontend/src/components/CoachDirectory.tsx": "Coach directory with search, follow/unfollow, admin delete actions, and profile detail modal integration.",
  "frontend/src/components/CoachProfileDetailModal.tsx": "Displays a detailed modal for a coach profile with tabs, posts, job listings, follow/unfollow actions, and admin/delete controls using various queries.",
  "frontend/src/components/EditPostModal.tsx": "Modal for editing an existing post, including updating content and adding or removing attachments before saving changes.",
  "frontend/src/components/Footer.tsx": "Static footer displaying copyright info and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling login/logout, theme switching, and user avatar/profile menu with admin support.",
  "frontend/src/components/ImageCropper.tsx": "Empty placeholder component file with no implementation.",
  "frontend/src/components/JobBoard.tsx": "Job board UI enabling posting, viewing, applying to, and deleting job listings with dialogs and profile lookups.",
  "frontend/src/components/MessagingHub.tsx": "Messaging interface allowing users to view connections, select a chat, and exchange direct messages with profiles.",
  "frontend/src/components/MyProfile.tsx": "Component for displaying and editing the current user's profile, including bio details, positions, roles, and photo upload with preview handling.",
  "frontend/src/components/PostAttachmentRenderer.tsx": "Renders post attachments by detecting type and displaying images, videos, PDFs, or download links accordingly.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for initial profile setup, allowing users to enter details, select positions and roles, and upload a profile photo.",
  "frontend/src/components/SocialFeed.tsx": "Main social feed component handling post creation, sorting, interactions, and attachment rendering with support for comments and likes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context and utilities for login, logout, and identity state management using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, photos, and related coach data via the backend actor. Includes error handling, cache updates, and integration with authentication state.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for light and dark themes. Applies global background, text, and border styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers. Loads global styles and renders the App component.",
  "frontend/src/pages/Dashboard.tsx": "Implements a tab-based dashboard switching between feed, coaches, jobs, messages, and profile sections. Uses UI components and icons to structure navigation.",
  "frontend/src/pages/LandingPage.tsx": "Renders the public landing page with hero content, feature cards, and login integration via Internet Identity. Displays branding and marketing layout for the app.",
  "frontend/src/utils/attachmentTypes.ts": "Utility functions to detect whether a file is a video, PDF, or image based on MIME type and filename.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters, including sessionStorage fallback and hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens aligned with CSS variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing current attachment-viewer refactor progress, architecture notes, existing features, and known issues."
}