{
  "backend/main.mo": "Defines social, messaging, job, and coach profile data types with comparison helpers and initializes maps, lists, and mixins for authorization and blob storage.",
  "feature_evidence.json": "Feature evidence report listing two UI overflow‑fix features tied to CoachProfileDetailModal.tsx with associated components and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of each frontend file in the project.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens for light and dark themes and applying global background/foreground styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root app component handling authentication, profile initialization with timeout safeguards, and routing between landing and dashboard views.",
  "frontend/src/components/AdminBadge.tsx": "Destructive‑style badge component displaying an admin label with a shield icon.",
  "frontend/src/components/AdminBanner.tsx": "Admin‑only alert banner that polls for new notifications and allows dismissal via mutation.",
  "frontend/src/components/CoachDirectory.tsx": "Coach directory with search, follow/unfollow, admin delete actions, profile cards, and modal integration.",
  "frontend/src/components/CoachProfileDetailModal.tsx": "Modal displaying detailed coach profiles with tabs, posts, jobs, follow actions, and admin controls including delete operations.",
  "frontend/src/components/EditPostModal.tsx": "Modal for editing posts, allowing text updates and attachment management before submitting changes.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright info and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling authentication, theme toggling, and user profile avatar with dropdown actions.",
  "frontend/src/components/ImageCropper.tsx": "Empty placeholder component file with no implementation.",
  "frontend/src/components/JobBoard.tsx": "Job board for viewing, posting, applying to, and deleting job listings with admin and form controls.",
  "frontend/src/components/MessagingHub.tsx": "Messaging interface for viewing connections, selecting a conversation, and sending direct messages.",
  "frontend/src/components/MyProfile.tsx": "Profile page with edit mode, photo handling, and fields for coach details, using queries to load and update profile data.",
  "frontend/src/components/PostAttachmentRenderer.tsx": "Renders attachments as images, videos, PDFs, or generic files with download/open actions based on MIME type.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for initial coach profile setup with photo upload, position/role selectors, and profile submission.",
  "frontend/src/components/SocialFeed.tsx": "Main social feed with posts, comments, likes, attachments, admin actions, sorting, and profile lookups.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, photos, and related data via an actor API with caching and error handling.",
  "frontend/src/index.css": "Sets up Tailwind base styles and defines light/dark theme CSS variables and global styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, providing React Query and Internet Identity context providers.",
  "frontend/src/pages/Dashboard.tsx": "Implements a tab-based dashboard UI switching between feed, coaches, jobs, messages, and profile views.",
  "frontend/src/pages/LandingPage.tsx": "Renders the public landing page with hero content, feature cards, and login integration via Internet Identity.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom theme variables, colors, animations, and plugins like typography and container queries.",
  "project_state.json": "JSON describing the platform’s versioned project state, high-level summary, and a list of existing implemented features with IDs, titles, synonyms, descriptions, and versions."
}