{
  "backend/main.mo": "Defines core data types, comparison helpers, and in-memory maps for posts, messages, job posts, profiles, and access control, integrating authorization and blob-storage mixins.",
  "feature_evidence.json": "Feature evidence report linking attachment-rendering requirements to affected frontend file and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and recent updates of various frontend files.",
  "frontend/index.css": "Tailwind base and theme variable definitions providing light/dark mode OKLCH color tokens.",
  "frontend/index.html": "HTML entrypoint that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile initialization, and dashboard/landing rendering with timeout-based profile loading.",
  "frontend/src/components/AdminBadge.tsx": "Simple badge component showing an ADMIN label with a shield icon.",
  "frontend/src/components/AdminBanner.tsx": "Admin-only banner that polls for report notifications and allows dismissing them.",
  "frontend/src/components/CoachDirectory.tsx": "Coach directory with search, follow/unfollow, admin delete actions, and profile detail modal integration.",
  "frontend/src/components/CoachProfileDetailModal.tsx": "Displays a detailed coach profile modal with tabs, posts, job listings, and admin actions including follow/unfollow and account deletion.",
  "frontend/src/components/EditPostModal.tsx": "Provides a modal for editing a post’s text and attachments, handling updates and file management.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and an external link.",
  "frontend/src/components/Header.tsx": "Shows the site header with login/logout, theme toggling, and user dropdown with profile info.",
  "frontend/src/components/ImageCropper.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/components/JobBoard.tsx": "Implements a job board with posting, viewing, applying, and admin deletion of job listings.",
  "frontend/src/components/MessagingHub.tsx": "Provides a messaging interface for viewing connections and exchanging direct messages.",
  "frontend/src/components/MyProfile.tsx": "Provides a user profile page with editable fields, photo upload, and admin badge display driven by multiple query hooks.",
  "frontend/src/components/PostAttachmentRenderer.tsx": "Renders post attachments by detecting file type and displaying images inline or offering external open/download links for other types.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for initial profile setup allowing users to enter details, select roles/positions, and upload a photo before saving.",
  "frontend/src/components/SocialFeed.tsx": "Implements the social feed with posts, comments, likes, attachments, sorting, and admin actions using various backend queries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, login flow, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, photos, and related data via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base layers and CSS variables for light and dark theme styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard with tabbed navigation for feed, coaches, jobs, messages, and profile.",
  "frontend/src/pages/LandingPage.tsx": "Renders the public landing page with hero section, features, and login button using Internet Identity.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom theme variables, plugins, and responsive settings.",
  "project_state.json": "Tracks project configuration, known issues, and feature requests related to attachment rendering."
}