{
  "backend/main.mo": "Defines data types and comparison functions for posts, job posts, messages, and coach profiles, and initializes maps for social features, storage, authorization, and follow relations.",
  "feature_evidence.json": "Lists feature evidence entries mapping UI requirements to specific frontend files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "Provides short descriptions of major frontend files, explaining their purpose and recent updates such as attachment handling, styling, and component behaviors.",
  "frontend/index.css": "Tailwind base style definitions including OKLCH color tokens, dark mode variables, and global component styling.",
  "frontend/index.html": "Basic HTML entry point that loads the React application into the root container.",
  "frontend/PARITY_CHECKLIST.md": "Documentation checklist verifying that the frontend matches the live XOROOTS branding, styling, responsiveness, and asset usage.",
  "frontend/src/App.tsx": "Main React app component handling authentication flow, theme provider, conditional rendering of header/dashboard, and displaying the profile setup modal with timeout logic.",
  "frontend/src/components/AdminBadge.tsx": "Renders a red destructive-style admin badge with an icon for marking administrator users.",
  "frontend/src/components/AdminBanner.tsx": "Displays a dismissible admin-only alert banner for new reports, with periodic polling for updates.",
  "frontend/src/components/AuthenticatedScrollingLogoBackground.tsx": "Renders the scrolling XOROOTS logo background layer for authenticated pages using the centralized branding asset.",
  "frontend/src/components/BrandLogo.tsx": "Renders a brand logo image with size options and falls back to text if the image fails to load.",
  "frontend/src/components/CoachDirectory.tsx": "Displays a searchable list of coach profiles with follow, admin, and delete actions.",
  "frontend/src/components/CoachProfileDetailModal.tsx": "Modal showing detailed coach info with follow/unfollow, post/job deletion, and account removal options.",
  "frontend/src/components/EditPostModal.tsx": "Modal for editing a post’s content and attachments with support for adding or removing files.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright info and a link to caffeine.ai with dynamic hostname tagging.",
  "frontend/src/components/Header.tsx": "Top navigation bar with logo, theme toggle, profile menu, and logout handling.",
  "frontend/src/components/ImageCropper.tsx": "Empty component placeholder for future image cropping functionality.",
  "frontend/src/components/JobBoard.tsx": "Job board for posting, viewing, applying, and deleting coaching-related job listings.",
  "frontend/src/components/MessagingHub.tsx": "Provides a connections list and chat UI, fetching profiles and messages and allowing sending direct messages.",
  "frontend/src/components/MyProfile.tsx": "Displays and edits the user's profile including photo, bio, roles, and positions with update and preview logic.",
  "frontend/src/components/PostAttachmentRenderer.tsx": "Renders post attachments with type detection, inline previews, fallback handling, and download support.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for initial profile creation, handling photo upload, positions, roles, and saving data to the backend.",
  "frontend/src/components/SocialFeed.tsx": "Implements the social feed with posting, sorting, liking, commenting, attachments, and profile lookups.",
  "frontend/src/constants/branding.ts": "Defines centralized branding constants for the app name and logo.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, with auto-invalidation of dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing login, stored identities, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating profiles, photos, and related backend data using the actor and identity context.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles, theme variables, and a scrolling logo background for authenticated views.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main authenticated dashboard with tabbed navigation for feed, coaches, jobs, messages, and profile.",
  "frontend/src/pages/LandingPage.tsx": "Renders the public landing page with hero content, features, and login button using Internet Identity.",
  "frontend/src/utils/attachmentTypes.ts": "Utility helpers to detect if file attachments are videos, PDFs, or images based on MIME type and filename.",
  "frontend/src/utils/blobMime.ts": "Provides MIME type inference from file extensions and ensures valid MIME types for files.",
  "frontend/src/utils/downloadAttachment.ts": "Downloads an attachment by fetching bytes, constructing a Blob with inferred MIME type, and triggering a browser download.",
  "frontend/src/utils/imageBlobUrl.ts": "Provides a utility to create an image URL from an ExternalBlob with fallback to Blob URLs and a React hook to manage loading and cleanup.",
  "frontend/src/utils/urlParams.ts": "Implements helpers for reading URL parameters, storing them in sessionStorage, and removing or persisting them across navigation.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, spacing, typography, container settings, and animations for the frontend.",
  "project_state.json": "Describes project state and requirements for placing and using XOROOTS logo assets in the UI and background."
}