{
  "kind": "build_request",
  "title": "Place XOROOTS logo in top-left and add transparent scrolling logo background on authenticated pages",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the authenticated app header displays the XOROOTS logo anchored in the top-left of the viewport on all logged-in pages (i.e., wherever <Header /> is rendered), with consistent sizing and spacing so it is visibly top-left (not centered) across breakpoints.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Put my logo in the top-left. Add my logo as a transparent scrolling background on the logged‑in pages.",
          "apply both changes"
        ]
      },
      "acceptanceCriteria": [
        "When logged in, the XOROOTS logo is visible in the header at the far left edge of the header content area on all dashboard tabs/pages.",
        "Logo remains top-left on mobile and desktop and does not shift to center due to container/grid changes.",
        "Logo continues to render via the shared BrandLogo component (no duplicated hardcoded <img> paths in pages)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a transparent, continuously scrolling background using the XOROOTS logo on authenticated (logged-in) pages only, behind the Dashboard content, without impacting readability or blocking interactions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add my logo as a transparent scrolling background on the logged‑in pages."
        ]
      },
      "acceptanceCriteria": [
        "When logged in, a repeating XOROOTS logo background is visible behind the dashboard UI with low opacity (subtle watermark effect).",
        "The background scrolls/animates continuously (e.g., diagonal or horizontal drift) and loops seamlessly.",
        "The background layer does not intercept clicks/scroll (pointer-events disabled) and stays behind all content (correct z-index).",
        "When logged out (LandingPage), the scrolling watermark background is not present."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Use the user-provided XOROOTS logo asset(s) for the header logo and the authenticated scrolling background (preferably via the centralized BRANDING.logo.src reference) and keep delivery as static frontend assets (no backend proxying).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "apply both changes"
        ]
      },
      "acceptanceCriteria": [
        "Header logo and the authenticated scrolling background both reference the same centralized logo source (BRANDING.logo.src) or an explicitly documented branding constant used by BrandLogo and the background.",
        "Logo assets are served from the frontend static assets directory (e.g., frontend/public/assets/...) and are not fetched via backend calls."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (Shadcn components are read-only).",
    "Do not edit immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx."
  ],
  "nonGoals": [
    "No changes to backend canister logic or data model.",
    "No changes to authentication behavior or session restoration.",
    "No redesign of the landing page hero background image beyond ensuring the scrolling logo background applies only to authenticated pages."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}