{
  "kind": "build_request",
  "title": "Fix live feed attachments: render images inline and open non-image files via external link",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the attachment rendering logic so image attachments display inline in the live feed (and anywhere else attachments are rendered) instead of falling back to a download/open link.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7",
          "msg-11"
        ],
        "quotes": [
          "the live page now has a download link instead of the images that is posted. I want it to show the image posted on the live feed."
        ]
      },
      "acceptanceCriteria": [
        "When a post has an image attachment, the feed shows the actual image preview inline (using an <img> preview), not just a download/open link.",
        "If an attachment has a missing/empty/unknown MIME type (e.g., application/octet-stream) but its filename extension indicates an image (e.g., .jpg, .jpeg, .png, .gif, .webp), it still renders inline as an image.",
        "This behavior applies consistently anywhere PostAttachmentRenderer is used (e.g., SocialFeed posts, coach profile post lists, edit post modal previews)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Change non-image attachment behavior (PDF, video, and other file types) so the feed presents an external open/download link (new tab) rather than attempting to render the content inline.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7",
          "msg-11"
        ],
        "quotes": [
          "If someone posts a pdf, video, etc can it make it download to an external link so that the person on the xoroots app can video it?"
        ]
      },
      "acceptanceCriteria": [
        "If an attachment is a PDF, video, or any non-image type, the UI shows a clear action (e.g., “Open” / “Download”) that opens the attachment URL in a new browser tab/window (target=\"_blank\" with rel=\"noopener noreferrer\").",
        "Non-image attachments do not render as inline media players/previews in the feed (e.g., no embedded <video> preview in the post card).",
        "Clicking the action uses the direct blob URL (attachment.blob.getDirectURL()) so the file can be viewed/downloaded externally."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only Shadcn components).",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts / .tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Keep the backend as a single Motoko actor; no additional backend services or external storage integrations."
  ],
  "nonGoals": [
    "Implementing an in-app document/video viewer inside the feed beyond the requested external open/download behavior.",
    "Adding support for third-party storage providers or CDN links."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}