{
  "kind": "build_request",
  "title": "Rebuild attachment rendering with inline video and PDF viewers",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the post attachment UI so video attachments render as an inline player (instead of an external link), using the attachment’s direct blob URL.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "rebuild with inline viewers"
        ]
      },
      "acceptanceCriteria": [
        "In the social feed, attachments detected as video (by mimeType starting with `video/` or filename extension match) render a playable inline `<video>` element with controls.",
        "The inline video player uses `attachment.blob.getDirectURL()` as its source and does not require downloading the file first.",
        "The inline video player layout is responsive and fits within the existing attachment grid without breaking card layout."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the post attachment UI so PDF attachments render inline in-place (instead of an external link), using the attachment’s direct blob URL.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "rebuild with inline viewers"
        ]
      },
      "acceptanceCriteria": [
        "In the social feed, attachments detected as PDF (mimeType `application/pdf` or filename ending in `.pdf`) render an inline PDF viewer (e.g., `<iframe>`/`<embed>`) using `attachment.blob.getDirectURL()` as the source.",
        "PDFs are viewable in-place without requiring an explicit download action.",
        "If inline PDF viewing fails to load (e.g., browser restriction), the UI still provides a clear fallback link/button to open the PDF in a new tab."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure inline viewers are used consistently anywhere post attachments are rendered (including the edit-post modal attachment previews).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "rebuild with inline viewers"
        ]
      },
      "acceptanceCriteria": [
        "In `EditPostModal`, existing attachments that are videos or PDFs use the same inline viewer behavior as in the feed.",
        "Image attachments continue to render inline as images as they do currently.",
        "Non-video/non-PDF/non-image attachments continue to render using the existing fallback download/open link UI."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under `frontend/src/components/ui` (compose existing shadcn components instead).",
    "Do not edit files listed as immutable in SYSTEM_CONTEXT: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`.",
    "Keep backend architecture as a single Motoko actor in `backend/main.mo`; no new backend canisters/services."
  ],
  "nonGoals": [
    "Adding real-time streaming, adaptive bitrate, or WebSocket-based playback features.",
    "Implementing third-party PDF rendering services or external CDN hosting for attachments.",
    "Changing how attachments are stored or uploaded on the backend (this request is UI viewing only)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}