{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Authenticated header logo positioning and scrolling watermark background",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Keep XOROOTS logo visibly anchored at the far left of the authenticated header across breakpoints using the shared BrandLogo component.",
      "acceptanceCriteria": [
        "When logged in, the XOROOTS logo is visible in the header at the far left edge of the header content area on all dashboard tabs/pages.",
        "Logo remains top-left on mobile and desktop and does not shift to center due to container/grid changes.",
        "Logo continues to render via the shared BrandLogo component (no duplicated hardcoded <img> paths in pages)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Adjust the header layout so the BrandLogo stays anchored to the left edge of the header content area across breakpoints (e.g., ensure the left logo container uses mr-auto / justify-start behavior and cannot be centered by container/grid changes), while keeping the right-side controls aligned to the right."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Render a subtle, continuously scrolling XOROOTS logo watermark background on authenticated pages only, behind dashboard content without blocking interactions.",
      "acceptanceCriteria": [
        "When logged in, a repeating XOROOTS logo background is visible behind the dashboard UI with low opacity (subtle watermark effect).",
        "The background scrolls/animates continuously (e.g., diagonal or horizontal drift) and loops seamlessly.",
        "The background layer does not intercept clicks/scroll (pointer-events disabled) and stays behind all content (correct z-index).",
        "When logged out (LandingPage), the scrolling watermark background is not present."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AuthenticatedScrollingLogoBackground.tsx",
          "operation": "create",
          "description": "Create a dedicated background layer component that renders a repeating logo watermark using BRANDING.logo.src, uses low opacity, sets pointer-events-none, and applies a seamless looping animation for continuous scrolling/drift."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the AuthenticatedScrollingLogoBackground to render only when authenticated, positioned behind the authenticated <Dashboard /> content (e.g., wrap the authenticated main area in a relative container with correct z-index layering so content stays readable and interactive)."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add global CSS keyframes/utility classes needed for the continuous scrolling watermark animation (looping, subtle opacity), ensuring the background remains behind content and does not affect readability."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Use the same centralized XOROOTS logo source (BRANDING.logo.src) for both the header logo and authenticated scrolling background as static frontend assets.",
      "acceptanceCriteria": [
        "Header logo and the authenticated scrolling background both reference the same centralized logo source (BRANDING.logo.src) or an explicitly documented branding constant used by BrandLogo and the background.",
        "Logo assets are served from the frontend static assets directory (e.g., frontend/public/assets/...) and are not fetched via backend calls."
      ],
      "file_operations": [
        {
          "path": "frontend/src/constants/branding.ts",
          "operation": "modify",
          "description": "Confirm/maintain the centralized BRANDING.logo.src static asset reference for XOROOTS so both BrandLogo and the authenticated background component share the same source of truth."
        },
        {
          "path": "frontend/src/components/AuthenticatedScrollingLogoBackground.tsx",
          "operation": "modify",
          "description": "Ensure the watermark background uses BRANDING.logo.src (same reference as BrandLogo) and does not introduce any new hardcoded logo paths or backend-fetched image URLs."
        }
      ]
    }
  ]
}