{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix attachment rendering in live feed: inline images, external links for non-images",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure image attachments render inline everywhere attachments are shown, including when MIME type is missing/unknown but filename indicates an image.",
      "acceptanceCriteria": [
        "When a post has an image attachment, the feed shows the actual image preview inline (using an <img> preview), not just a download/open link.",
        "If an attachment has a missing/empty/unknown MIME type (e.g., application/octet-stream) but its filename extension indicates an image (e.g., .jpg, .jpeg, .png, .gif, .webp), it still renders inline as an image.",
        "This behavior applies consistently anywhere PostAttachmentRenderer is used (e.g., SocialFeed posts, coach profile post lists, edit post modal previews)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PostAttachmentRenderer.tsx",
          "operation": "modify",
          "description": "Update image detection to render inline <img> when either (a) MIME type starts with image/ OR (b) MIME type is missing/unknown and fileName extension indicates an image (.jpg/.jpeg/.png/.gif/.webp). Keep using attachment.blob.getDirectURL() as the src so all current usage sites (SocialFeed, CoachProfileDetailModal, EditPostModal) inherit the behavior. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Render PDFs, videos, and any non-image attachments as an external open/download link (new tab) and avoid inline previews/players in the feed.",
      "acceptanceCriteria": [
        "If an attachment is a PDF, video, or any non-image type, the UI shows a clear action (e.g., “Open” / “Download”) that opens the attachment URL in a new browser tab/window (target=\"_blank\" with rel=\"noopener noreferrer\").",
        "Non-image attachments do not render as inline media players/previews in the feed (e.g., no embedded <video> preview in the post card).",
        "Clicking the action uses the direct blob URL (attachment.blob.getDirectURL()) so the file can be viewed/downloaded externally."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PostAttachmentRenderer.tsx",
          "operation": "modify",
          "description": "Remove inline rendering for non-image types (including current <video> and PDF-specific preview UI) and replace with a consistent file card that provides a clear “Open”/“Download” action implemented as an <a> pointing to attachment.blob.getDirectURL(), opened in a new tab (target=\"_blank\" with rel=\"noopener noreferrer\"). Ensure the action is used for PDFs, videos, and all other non-image attachments. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}